//
//  DestinyNumber.swift
//  DestinyNumbers
//
//  Created by Kyle Lei on 2021/12/1.
//

import Foundation

struct DestinyNumber {
    var number: Int
    var numberMeaning: String
    var pros: String
    var cons: String
    var descriptions: String
}


var destinyNumbers = [
    DestinyNumber(number: 0, numberMeaning: "", pros: "", cons: "", descriptions: ""),
    DestinyNumber(number: 1, numberMeaning: "開創", pros:"獨立、積極、創造、領導、能量，富創意與理解力，為人聰明，喜歡領導。", cons: "強勢、獨斷、浮躁、自私、懶散、吹牛，主觀意識強，我行我素，人際關係淡薄。", descriptions: """
                  1 熱愛獨立，不惜代價追求獨立，天生的領袖，充滿自動自發的精神，衝力十足，精力充沛，非常不喜歡別人依賴他們。
                  
                  看事情的眼光是二分法，凡事非黑即白，優點是比較容易做決定，是領導人的必備條件，缺點則是容易極端，外向而積極，勇於表達自己的主張，也希望別人有話直說，不要拐彎抹角，喜歡獨特的或是絕無給僅有的事務，他們不願意一窩蜂跟流行，寧可自創一格，創意十足，點子奇多，想法創新，看事情往往開門見山，單刀直入，這種方式適合做生意，在戀愛或婚姻裡會讓人覺得冷酷.不浪漫.自私。
                  
                  處理事情要求迅速有效，一旦事情出差錯，非常容易發火，不惜挑戰權威，想也不想就收回承諾，掉頭就走。
                  
                  同時，1是個充滿創意的數字，你們有過人的膽識，不僅勇於改變、也勇於嘗試，你們在生活、工作中常有異於常人的創想，這會讓你們的表現特別受矚目，也是你最容易成功的地方。
                  """),
    DestinyNumber(number: 2, numberMeaning: "協調", pros: "敏感、體貼、柔順、和諧、依賴，個性內斂，善於分工合作，重視群體關係，喜歡受到別人肯定。", cons: "情緒不定、優柔寡斷、難以捉摸、膚淺不安，容易因他人的意見而受到影響，不能忍耐孤獨。", descriptions: """
2 非常注意細節，具備最佳的分析能力和辨識能力，喜愛發問和思考。

天生的外交家與公關人才，擅與溝通.感情豐富.親切溫和.對於感情世界的話題特別敏感，眼看愛情關係就要走不下去了她們很少會是主動提出的一方。

2數人並不喜歡帶頭主導，願意與人合作而不喜歡單獨行事，對任何事很不容易做決定，不會採取主動積極的作為，寧可等別人找她們去參與事務，也不主動邀別人加入。
"""),
    DestinyNumber(number: 3, numberMeaning: "創意", pros: "行動、樂觀、自信、表現、社交，聰明機警，有創意，多具有藝術天份，表達能力強。", cons: "欺瞞、虛榮浮華、憤世嫉俗、渙散不集中，任性，多只依自己的喜好行事，容易好高騭遠。", descriptions: """
個性特質從事務表面的樣子看事情，很在意形象與外觀，對自己不喜歡的東西很有意見，面對人生的態度，很像被寵壞的小孩，也是所有數字中最頑固的一群。

對愛情方面，一旦遇到夢寐以求的對象，無論是否有機會成功，3 數人立即墮陷入情網，無法自拔。

3 數人是長袖善舞的人，因為他們活潑有趣，喜歡逗人開心，常常能帶給大家歡樂。

3 數人在從事創意工作時覺得最快樂。
"""),
    DestinyNumber(number: 4, numberMeaning: "務實", pros: "忠誠、次序、效率、助人、自律，組織能力強，做事條理分明，目光敏銳，能迅速掌握重點。", cons: "獨斷獨行、心胸狹窄、容易緊張、不易妥協，固執，缺乏安全感，不敢承擔風險，因此容易讓機會溜走。", descriptions: """
4 數人的安全感意識非常強烈。
4 數人不以創造力出名，不需要從零開始，只須從既有的東西中做選擇，就能做到別人所不能及的效能，是天生的建設好手，因為建設正是一種建立安全感的方法，不愛冒險的特性，使得他們比較受雇於人，比較不喜歡自己當老闆。

當他們受到挑戰與質疑，會高度自我防衛，固執異常。
"""),
    DestinyNumber(number: 5, numberMeaning: "自由", pros: "聰穎、冒險、適應強、多變化、學習快，能答善辯，口才極佳，熱情豪爽，講義氣，崇尚自由。", cons: "博而不精、持續力差、毫不在乎、索求無度，不喜歡受到束縛，容易放縱，容易得罪別人。", descriptions: """
5 數人能言善道，口齒伶俐，擅於表達，很容易博得別人的支持與信任，也很容易與人相處，口才一流加上易取得好感，成為溝通高手，特別適合從事銷售或者進入大眾傳播媒體及政治圈。

5 數人在傳達訊息的時候非常清晰簡潔，把這特質運作在政界及商場就很能獲得別人的信任，為他們創造很多機會，帶來好處。

在情場上，5 數人的熱愛自由就是大麻煩了，需要愛情又不喜歡被約束，常覺得單身比較輕鬆，並且不喜歡被責任壓著的感覺。

喜歡嘗試新事務，感官很發達，不惜一切要維持多彩多姿的自由自在生活。
"""),
    DestinyNumber(number: 6, numberMeaning: "關懷", pros:" 穩定、信賴、熱情、正義、奉獻，情感細膩，擅長人際間的交際，喜歡幫助他人，重承諾與責任。", cons: "缺乏自信、不切實際、好強爭辯、強行干涉，不理智時，常會做出錯誤的決定，付出不求回報時容易讓自己受傷。", descriptions: """
6 數的個性特質本能就想修補東西及解決問題，天生十分敏感，對別人的痛苦感同身受，因太過強烈而陷入別人的問題中，他們勇於扛責任，即使已經超過他們的能力範圍，也在所不辭，他們只是藉著幫助別人來取得被須要的感覺罷了，被須要的感覺是 6 數人的生命補給，讓他們覺得人生不虛此行。

6 數的人生目標，一生都想要修理東西，解決問題，以及鼓勵別人開創美好人生，當他們的付出需要對方的回應，才覺得有被尊重的感覺，他們這份的熱誠對人，應該運用到社會志工，或宗教團體。
"""),
    DestinyNumber(number: 7, numberMeaning: "探究", pros: "內省、沉默、直覺、真理、理想，擅長鑽研事物，喜歡追求真理，精於算計，遇事理智。", cons: "冷漠、自大傲慢、自我放縱、鬼鬼祟祟，處事不夠圓滑，不容易被討好，容易到手的東西不會珍惜。", descriptions: """
7 數人天生好奇，他們不看事務的表面價值，卻喜歡不斷發問，探究事情背後的真像。

7 數人可能是最講邏輯的，因為他們的思考基礎都植基於他們確知的事實真像上。

7 數人的思考大多出自黑白分明的角度，他們是邏輯取向的人，能快速分析情勢，常可從務實的考量做出決定。

7 數人能一眼看穿事情的問題所在，對品質的概念非常先進，從來無懼於說出誠實的意見。
"""),
    DestinyNumber(number: 8, numberMeaning: "權威", pros:" 忠貞、持續、堅定、誠懇、照料，喜歡冒險刺激，有商業頭腦，喜歡追求權力，能即知即行。", cons: "唯物主義、無道德感、心高氣傲、排除他議，驕傲，對喜歡的東西有異常的執著，面對衝突時會勉強自己。", descriptions: """
8 數人獨具慧眼，一眼就看出哪些人事物具有潛力，8 數人常常會不為任何特定目的就主動幫助別人發展，8 數是高八音階的 1 數，因此也具備了 1 數的領導才華和追求獨立的特質，它會驅使人積極尋求金錢上的獨立，而且是遠超過實際需求的數目。

8 數人比較讓人不解的是雖然他們個性剛強，但表現於外卻不是那回事，反而像貓咪般溫順，1 數人挺身而出多半是為自己，而 8 數人強出頭都是為別人，8 數人天生很有商業頭腦，天生是生意人。
"""),
    DestinyNumber(number: 9, numberMeaning: "智慧", pros: "人性、啟發、活力、關懷、靈性，充滿生命力，能從創意之中獲得滿足感，處事隨機應變，見招拆招。", cons: "卑躬屈膝、毫無原則、善於批評、沒有耐性，行事不務實，意志不夠堅定，想像太過於力豐富則會變成天馬行空。", descriptions: """
9 多才多藝的一群，想像力豐富夢想家，相信天下沒有不可能的事，9 數人如此堅信夢想，原因是很早就發現自己輕鬆就能學會十八般武藝，許多小說與故事都出自 9 數人之手，9 數人的夢想與計劃就像電影情節，沒有任何限制，由於他們不用務實的眼光面對生活，因而在人生中倍嚐艱困，9 數人對於別人的需求十分敏感，覺得助人是義不容辭的事，不過 9 數人多半沒有解決別人真正的問題，沒有把痛苦的根源找出來，9 數人常扛下自己能力範圍的重責，很容易被人利用。
""")
  
    
]
